In [4]:
import sys
print(sys.version)
from os import path
from wordcloud import WordCloud
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

3.5.2 |Anaconda 4.2.0 (x86_64)| (default, Jul  2 2016, 17:52:12)
[GCC 4.2.1 Compatible Apple LLVM 4.2 (clang-425.0.28)]

In [7]:
df = pd.read_csv("../ShahAli.csv")
df.head()

,SL,NAME,ACCOUNT_NO,METER_NO,ADDRESS,ZONE,BLOCK,ROUTE,LOAD,TARIFF,METER_STATUS,MONTH,YEAR,UNIT
0,5702.0,PAIKPARA GOVT STAFF QTR,29000041,1068554,"BLD-129/10 MIRPUR, DHAKA",SAAA,100,10.0,2,A,Child,6,2001,176.0
1,5871.0,PAIKPARA GOVT STAFF QTR,29000041,1068554,"BLD-129/10 MIRPUR, DHAKA",SAAA,100,10.0,2,A,Child,9,2001,200.0
2,5904.0,PAIKPARA GOVT STAFF QTR,29000041,1068554,"BLD-129/10 MIRPUR, DHAKA",SAAA,100,10.0,2,A,Child,10,2001,220.0
3,5916.0,PAIKPARA GOVT STAFF QTR,29000041,1068554,"BLD-129/10 MIRPUR, DHAKA",SAAA,100,10.0,2,A,Child,8,2001,214.0
4,6041.0,PAIKPARA GOVT STAFF QTR,29000041,1068554,"BLD-129/10 MIRPUR, DHAKA",SAAA,100,10.0,2,A,Child,12,2001,149.0

In [8]:
df.tail()

,SL,NAME,ACCOUNT_NO,METER_NO,ADDRESS,ZONE,BLOCK,ROUTE,LOAD,TARIFF,METER_STATUS,MONTH,YEAR,UNIT
4550013,11034.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"House/Flat # 1/D, Road # 9/1, Block # A, Secti...",SAFP,100,180.01,2,E,Single,5,2016,4271.0
4550014,11144.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"House/Flat # 1/D, Road # 9/1, Block # A, Secti...",SAFP,100,180.01,2,E,Single,6,2016,4219.0
4550015,11271.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"House/Flat # 1/D, Road # 9/1, Block # A, Secti...",SAFP,100,180.01,2,E,Single,7,2016,4363.0
4550016,11461.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"House/Flat # 1/D, Road # 9/1, Block # A, Secti...",SAFP,100,180.01,2,E,Single,8,2016,4934.0
4550017,11506.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"House/Flat # 1/D, Road # 9/1, Block # A, Secti...",SAFP,100,180.01,2,E,Single,9,2016,4555.0

In [9]:
df.ADDRESS = df.ADDRESS.apply(lambda x: x.upper())
df.tail()

,SL,NAME,ACCOUNT_NO,METER_NO,ADDRESS,ZONE,BLOCK,ROUTE,LOAD,TARIFF,METER_STATUS,MONTH,YEAR,UNIT
4550013,11034.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"HOUSE/FLAT # 1/D, ROAD # 9/1, BLOCK # A, SECTI...",SAFP,100,180.01,2,E,Single,5,2016,4271.0
4550014,11144.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"HOUSE/FLAT # 1/D, ROAD # 9/1, BLOCK # A, SECTI...",SAFP,100,180.01,2,E,Single,6,2016,4219.0
4550015,11271.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"HOUSE/FLAT # 1/D, ROAD # 9/1, BLOCK # A, SECTI...",SAFP,100,180.01,2,E,Single,7,2016,4363.0
4550016,11461.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"HOUSE/FLAT # 1/D, ROAD # 9/1, BLOCK # A, SECTI...",SAFP,100,180.01,2,E,Single,8,2016,4934.0
4550017,11506.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"HOUSE/FLAT # 1/D, ROAD # 9/1, BLOCK # A, SECTI...",SAFP,100,180.01,2,E,Single,9,2016,4555.0

In [10]:
df.isnull().sum()

SL              11792
NAME                0
ACCOUNT_NO          0
METER_NO         1023
ADDRESS             0
ZONE                0
BLOCK               0
ROUTE               0
LOAD                0
TARIFF              0
METER_STATUS       47
MONTH               0
YEAR                0
UNIT                0
dtype: int64

In [12]:
df = df.dropna()
df.isnull().sum()

SL              0
NAME            0
ACCOUNT_NO      0
METER_NO        0
ADDRESS         0
ZONE            0
BLOCK           0
ROUTE           0
LOAD            0
TARIFF          0
METER_STATUS    0
MONTH           0
YEAR            0
UNIT            0
dtype: int64

In [22]:
columns = ['METER_NO','ADDRESS','ZONE','BLOCK','ROUTE']
droped_duplicates_df = df.drop_duplicates(['METER_NO'])
droped_duplicates_df.count()

SL              63492
NAME            63492
ACCOUNT_NO      63492
METER_NO        63492
ADDRESS         63492
ZONE            63492
BLOCK           63492
ROUTE           63492
LOAD            63492
TARIFF          63492
METER_STATUS    63492
MONTH           63492
YEAR            63492
UNIT            63492
dtype: int64

In [20]:
droped_duplicates_df.to_csv("../shahali_dropna_only_addresses.csv",index=False,columns=columns)

In [21]:
droped_duplicates_df.ZONE.value_counts()

SAAD    5311
SAFB    3246
SAAC    2708
SAFE    2311
SAFD    2204
SAAA    1850
SAAB    1810
SAAF     919
SAFG     126
SAFP     117
SAAP      40
Name: ZONE, dtype: int64

In [23]:
import re

In [24]:
import gmaps